tutorials/coaxial_crystallizer/0.org/C019
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C019;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    water_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    symmetry_plane
    {
        type            symmetry;
    }
    walls
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    solution_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
