tutorials/coaxial_crystallizer/constant/PDFdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      PDFdict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
C_phi C_phi [0 0 0 0 0 0 0] 2.0;
Sc_t Sc_t [0 0 0 0 0 0 0] 1.0;
P_tol P_tol [0 0 0 0 0 0 0] 1E-6;
Cmu Cmu [0 0 0 0 0 0 0] 0.09;
lamDiff lamDiff [0 2 -1 0 0 0 0] 1E-9;

phi1     (1.0
	  40.83041
	  0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0);

phi2     (0.0
	  0.0
	  0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0
            0);

// ************************************************************************* //
